set_input_delay -max 0.2 [get_ports "a[0]"]
set_input_delay -max 0.2 [get_ports "a[1]"]
set_input_delay -max 0.2 [get_ports "a[2]"]
set_input_delay -max 0.2 [get_ports "a[3]"]
set_input_delay -max 0.2 [get_ports "a[4]"]
set_input_delay -max 0.2 [get_ports "a[5]"]
set_input_delay -max 0.2 [get_ports "a[6]"]
set_input_delay -max 0.2 [get_ports "a[7]"]

set_input_delay -max 0.2 [get_ports "b[0]"]
set_input_delay -max 0.2 [get_ports "b[1]"]
set_input_delay -max 0.2 [get_ports "b[2]"]
set_input_delay -max 0.2 [get_ports "b[3]"]
set_input_delay -max 0.2 [get_ports "b[4]"]
set_input_delay -max 0.2 [get_ports "b[5]"]
set_input_delay -max 0.2 [get_ports "b[6]"]
set_input_delay -max 0.2 [get_ports "b[7]"]

set_input_delay -max 0.2 [get_ports "op[0]"]
set_input_delay -max 0.2 [get_ports "op[1]"]
set_input_delay -max 0.2 [get_ports "op[2]"]

set_output_delay -max 0.2 [get_ports "result[0]"]
set_output_delay -max 0.2 [get_ports "result[1]"]
set_output_delay -max 0.2 [get_ports "result[2]"]
set_output_delay -max 0.2 [get_ports "result[3]"]
set_output_delay -max 0.2 [get_ports "result[4]"]
set_output_delay -max 0.2 [get_ports "result[5]"]
set_output_delay -max 0.2 [get_ports "result[6]"]
set_output_delay -max 0.2 [get_ports "result[7]"]

set_output_delay -max 0.2 [get_ports "carry"]
set_output_delay -max 0.2 [get_ports "zero"]

set_load 0.10 [all_outputs]
set_max_fanout 20.00 [current_design]